{"i": 7904, "'d": 1261, "like": 3113, "to": 5734, "go": 1196, "a": 2565, "fancy": 8, "restaurant": 1851, ".": 15710, "french": 183, "food": 2426, "next": 126, "thursday": 88, "dinner": 909, "want": 1958, "eat": 1430, "have": 1490, "it": 978, "can": 952, "be": 974, "really": 144, "expensive": 273, "as": 117, "far": 196, "away": 217, "we": 96, "get": 249, "from": 872, "icsi": 679, "tell": 1064, "me": 1988, "about": 2820, "le": 74, "bateau": 74, "ivre": 74, "-": 792, "la": 228, "carte": 29, "show": 413, "the": 2799, "list": 447, "again": 268, "let": 438, "see": 167, "close": 198, "breakfast": 280, "instead": 35, "start": 725, "over": 721, "at": 674, "cheap": 260, "place": 392, "tomorrow": 135, "what": 802, "kinds": 8, "of": 1126, "do": 1116, "you": 1278, "know": 565, "american": 304, "moderate": 20, "distance": 528, "fifteen": 339, "minutes": 843, "said": 77, "sandwiches": 48, "please": 648, "um": 537, "more": 1442, "homemade": 30, "cafe": 594, "wan": 365, "na": 376, "some": 684, "chinese": 381, "right": 74, "now": 126, "lunch": 771, "twenty": 535, "'": 71, "walk": 215, "sun-hong-kong": 49, "blue": 66, "nile": 66, "vegetarian": 255, "monday": 171, "does": 406, "n't": 794, "matter": 254, "by": 46, "here": 170, "five": 675, "plearn": 106, "thai": 691, "cuisine": 272, "pizza": 242, "jupiter": 28, "greek": 116, "restaurants": 1064, "in": 975, "berkeley": 472, "today": 198, "and": 1285, "care": 129, "how": 594, "much": 221, "costs": 59, "meal": 229, "end": 3, "session": 1, "yeah": 33, "my": 168, "parents": 11, "are": 544, "coming": 36, "into": 14, "town": 16, "they": 163, "'re": 40, "paying": 29, "so": 416, "nice": 95, "california": 171, "for": 1496, "where": 442, "is": 1290, "uh": 1622, "'ll": 91, "two": 166, "weeks": 13, "saturday": 315, "that": 733, "would": 1684, "good": 321, "anytime": 10, "evening": 116, "fine": 71, "week": 88, "why": 22, "just": 121, "pastoral": 42, "'m": 732, "hurry": 8, "should": 533, "icksee": 386, "fast": 25, "real": 32, "soon": 7, "out": 160, "this": 226, "sunday": 208, "omelets": 29, "cappuccino": 8, "somewhere": 92, "north": 63, "well": 112, "anyways": 16, "guess": 53, "could": 269, "or": 624, "plain": 16, "old": 21, "tuesday": 158, "say": 170, "between": 159, "seven": 54, "eight": 132, "o'clock": 24, "night": 288, "going": 43, "work": 28, "too": 178, "has": 85, "best": 171, "croissants": 3, "friends": 19, "getting": 11, "together": 11, "tonight": 150, "round": 19, "six": 90, "p__m": 29, "there": 608, "any": 803, "serve": 102, "middle": 53, "eastern": 30, "friday": 224, "'ve": 52, "got": 62, "car": 100, "dammit": 3, "oh": 225, "somebody": 13, "on": 1556, "an": 310, "expense": 8, "account": 8, "money": 177, "no": 547, "hello": 38, "italian": 333, "spend": 621, "bucks": 106, "dollars": 1551, "twelve": 50, "than": 1106, "wednesday": 155, "indian": 337, "ten": 909, "mexican": 236, "forty": 78, "not": 938, "miles": 304, "foods": 14, "viva": 34, "taqueria": 180, "hour": 141, "less": 512, "one": 290, "information": 570, "house": 198, "try": 161, "something": 308, "east": 86, "asian": 146, "lot": 65, "within": 291, "walking": 262, "if": 140, "'s": 1825, "saday": 14, "beef": 31, "chow": 14, "fun": 16, "oriental": 53, "willing": 252, "pay": 102, "up": 228, "drive": 83, "driving": 11, "speaking": 19, "clear": 19, "english": 21, "take": 76, "further": 54, "burrito": 9, "waitresses": 3, "pretty": 22, "ay": 98, "caramba": 99, "other": 55, "au-coquelet": 43, "friend": 8, "likes": 4, "howbout": 61, "everything": 25, "barbecue": 138, "nina": 0, "thinks": 0, "totally": 0, "cool": 0, "looking": 238, "picky": 4, "very": 212, "high": 5, "quality": 5, "tasty": 5, "hi": 14, "anything": 79, "except": 4, "okay": 570, "look": 40, "thirty": 265, "farther": 15, "whether": 2, "around": 212, "with": 210, "entertainment": 9, "bar": 56, "full": 6, "coffee": 60, "drinks": 23, "snacks": 5, "although": 3, "wants": 3, "sandwich": 59, "closed": 12, "amount": 13, "vietnamese": 41, "road": 1, "a__m": 10, "normal": 12, "maybe": 93, "diner": 69, "under": 134, "shell": 7, "semolians": 7, "which": 202, "these": 49, "places": 95, "kind": 177, "upscale": 9, "yuppie": 9, "reservations": 24, "either": 41, "cheapest": 48, "authentic": 13, "burritos": 18, "seats": 13, "wo": 9, "stop": 1, "quick": 14, "bring": 10, "back": 81, "desk": 10, "foot": 19, "better": 24, "wish": 7, "fish": 56, "chips": 30, "brunch": 76, "drink": 34, "cup": 5, "closest": 28, "fruit": 0, "plate": 34, "spaghetti": 18, "find": 167, "taco": 2, "tacos": 2, "inexpensive": 63, "steak": 16, "shilpa": 34, "bombay": 35, "shin-shin": 29, "am": 133, "screaming": 7, "most": 130, "hong": 88, "kong": 78, "ocean": 89, "forget": 0, "move": 0, "ones": 26, "day": 182, "after": 35, "give": 318, "durant": 42, "thanks": 3, "original": 5, "soup": 49, "kitchen": 30, "heike": 21, "interested": 119, "side": 24, "job": 1, "thank": 52, "metropole": 61, "same": 11, "area": 38, "else": 28, "austrian": 11, "file": 5, "near": 136, "solano": 12, "avenue": 64, "will": 55, "type": 137, "cost": 402, "all": 102, "wanted": 64, "siam": 23, "make": 97, "reservation": 31, "help": 30, "japanese": 161, "cheaper": 43, "price": 142, "yoshi's": 5, "talking": 0, "spanish": 55, "skates": 23, "bay": 25, "telegraph": 20, "street": 78, "blondie": 55, "seafood": 73, "university": 35, "four": 45, "chez": 134, "panisse": 134, "mediumly": 2, "anyplace": 1, "change": 21, "caffe": 198, "giovanni": 131, "venezia": 105, "ethiopian": 51, "hear": 19, "juan's": 1, "juan": 25, "campus": 60, "kip": 3, "kip's": 11, "during": 41, "weekend": 107, "last": 26, "days": 5, "tour": 97, "eiffel": 97, "read": 0, "de": 17, "fourth": 24, "grill": 38, "arinell": 18, "milano": 25, "ristorante": 39, "persian": 44, "bit": 19, "sort": 3, "things": 4, "californian": 39, "your": 82, "database": 7, "little": 49, "medium": 17, "range": 86, "dollar": 127, "signs": 2, "three": 84, "quite": 5, "moderately": 10, "priced": 26, "fairly": 18, "anywhere": 155, "late": 72, "gon": 10, "confuse": 7, "huh": 8, "cambodiana's": 9, "nine": 13, "cha": 51, "plearn's": 0, "salads": 6, "understand": 26, "ultra": 5, "fondue": 12, "fred's": 9, "source": 0, "cafes": 5, "westside": 14, "bakery": 14, "maxim": 31, "maxim's": 3, "pardon": 1, "did": 78, "also": 77, "open": 278, "african": 75, "easier": 11, "menu": 107, "salad": 40, "sizzler": 9, "sizzler's": 3, "possible": 36, "travel": 209, "was": 60, "mcdonald's": 11, "elmwood": 54, "pharmacy": 53, "done": 1, "additional": 46, "nakapan": 42, "hundred": 138, "kilometers": 19, "ninety": 16, "stupid": 4, "peruvian": 3, "sushi": 128, "half": 131, "greasy": 10, "appreciate": 0, "burgers": 6, "first": 20, "actually": 40, "correction": 6, "per": 37, "person": 56, "mile": 127, "available": 31, "sundays": 41, "sorry": 3, "still": 32, "slow": 3, "service": 1, "choice": 2, "fifty": 144, "oakland": 12, "san__francisco": 9, "time": 63, "serving": 38, "mondays": 10, "russell": 6, "glass": 8, "water": 40, "date": 19, "cuban": 35, "happy": 2, "thought": 7, "zachary": 37, "overstatement": 6, "went": 48, "threw": 11, "chance": 1, "everywhere": 15, "drop": 15, "wine": 25, "come": 27, "christopher": 38, "fond": 14, "having": 29, "may": 34, "serves": 41, "german": 151, "cheeseburger": 5, "manuel's": 5, "pasta": 23, "before": 25, "morning": 30, "brick": 28, "hut": 28, "says": 5, "recording": 18, "but": 270, "quiet": 14, "brit": 29, "marie's": 2, "hungarian": 8, "dishes": 13, "afternoon": 20, "sentence": 0, "previous": 42, "soul": 8, "brother": 8, "use": 11, "m__s__g": 5, "bart": 29, "vin": 93, "public": 0, "parking": 0, "downtown": 20, "through": 11, "spats": 59, "them": 3, "senior": 1, "new": 5, "query": 8, "rockridge": 1, "screen": 3, "boran": 2, "bistro": 13, "upstairs": 5, "downstairs": 5, "mcdonald": 30, "spenger's": 13, "music": 3, "nights": 2, "hang": 0, "every": 10, "owner": 1, "goodbye": 3, "freeway": 1, "finished": 0, "quit": 9, "cancun": 57, "gertie": 1, "formal": 3, "decided": 1, "hamburger": 37, "long": 95, "way": 37, "prefer": 58, "reasonably": 24, "need": 83, "lab": 3, "shattuck": 53, "think": 113, "mood": 8, "object": 7, "bicycle": 23, "blocks": 159, "hungry": 21, "val's": 2, "val": 41, "euclid": 15, "recommend": 20, "international": 44, "deli": 61, "specified": 6, "yet": 6, "subway": 4, "delicatessen": 8, "opening": 10, "hours": 45, "ko": 22, "no.": 13, "villa": 51, "allston": 2, "pasand": 62, "thousand": 21, "kensington": 2, "yangtze": 29, "river": 29, "cambodian": 36, "mel": 19, "top": 11, "dog": 11, "edy's": 20, "greasiest": 2, "joint": 4, "hamburgers": 24, "mean": 8, "called": 17, "million": 2, "saw": 1, "andean": 1, "sujatha's": 11, "belly": 9, "dancing": 9, "once": 10, "remember": 9, "named": 9, "ooh": 9, "bongo": 0, "burger": 33, "pavilion": 9, "mary": 5, "she": 9, "sick": 5, "afterwards": 5, "confirmation": 5, "shilpa's": 4, "maharani": 22, "looks": 0, "interesting": 0, "madras": 46, "lilly's": 5, "lilly": 40, "mississippi": 10, "rich": 17, "potsticker": 17, "mediterranean": 43, "couple": 16, "important": 37, "lalime": 37, "gilman": 13, "lalime's": 2, "peralta": 3, "great": 35, "wall": 5, "desserts": 4, "jupiter's": 4, "taiwan": 28, "insist": 1, "case": 2, "preferably": 3, "stay": 3, "kentucky": 11, "fried": 11, "chicken": 15, "print": 1, "actual": 0, "excellent": 2, "plates": 2, "only": 94, "meat": 44, "maximally": 3, "vietnam": 34, "village": 30, "life": 57, "vegi": 80, "been": 2, "helpful": 2, "kosher": 43, "yogurt": 9, "ice": 47, "cream": 47, "bacon": 5, "eggs": 5, "regular": 0, "because": 20, "short": 25, "lots": 1, "mind": 48, "panini": 21, "indonesian": 37, "malaysian": 28, "then": 37, "burmese": 7, "minute": 35, "cajun": 12, "caribbean": 29, "gingerbread": 1, "concerned": 13, "ask": 22, "fat": 73, "apple's": 11, "apple": 40, "concerning": 1, "korean": 13, "specifically": 0, "waiters": 4, "polite": 4, "true": 3, "berkel": 7, "terrible": 3, "russian": 47, "unimportant": 5, "british": 14, "health": 0, "mother": 8, "visit": 8, "her": 5, "such": 9, "chopped": 5, "liver": 5, "hell": 6, "nefeli": 31, "louder": 2, "weekends": 26, "outside": 5, "nearest": 9, "station": 16, "china": 29, "yen": 8, "ching": 8, "planning": 1, "southern": 8, "style": 14, "cooking": 4, "european": 42, "another": 10, "later": 2, "polish": 26, "credit": 1, "cards": 1, "volga": 14, "personal": 0, "checks": 0, "edy": 22, "express": 7, "allows": 1, "smoking": 1, "age": 4, "limit": 7, "cactus": 52, "mediterranee": 41, "meant": 17, "south": 68, "won": 25, "turkish": 22, "mar": 40, "mara": 40, "midnight": 25, "sugar": 4, "free": 4, "items": 4, "none": 8, "jade": 5, "garden": 31, "meters": 57, "taiwanese": 7, "distant": 6, "strada": 6, "c'mon": 2, "block": 3, "radius": 6, "types": 7, "petrouchka": 30, "enoteca": 5, "mastro": 5, "prompt": 2, "primarily": 11, "depending": 6, "traveling": 5, "bette": 66, "view": 94, "weekday": 12, "must": 14, "musical": 9, "offering": 9, "alcohol": 5, "buffets": 3, "buffet": 14, "sujatha": 38, "manuel": 35, "when": 72, "tibetan": 3, "sudanese": 0, "thirteen": 7, "nineteen": 51, "bucci": 13, "second": 5, "thing": 11, "oops": 13, "kirala": 26, "recognized": 6, "norteno's": 5, "bucci's": 18, "king's": 3, "inexpensively": 2, "suggested": 3, "suggestion": 0, "choices": 2, "lococo": 34, "fanny": 41, "ticket": 23, "beer": 6, "listen": 2, "while": 2, "fred": 2, "omnivore": 14, "addison": 25, "annex": 25, "tambo": 22, "cross": 7, "guerrero's": 13, "rest": 0, "business": 6, "ethnic": 2, "rasa": 20, "sayang": 20, "restoran": 14, "cents": 16, "bastille": 11, "july": 11, "fourteenth": 11, "dinners": 8, "yoshi": 10, "ochame": 3, "taking": 2, "oliveto's": 7, "irrelevant": 0, "romantic": 3, "thinking": 21, "liquor": 0, "margaritas": 13, "peru": 1, "spot": 0, "mid-priced": 3, "frozen": 3, "parlors": 1, "slice": 24, "mykonos": 6, "searching": 7, "donuts": 4, "name": 38, "evans": 2, "hall": 2, "brazilian": 25, "nino": 7, "favorite": 32, "brazil": 6, "selects": 2, "match": 0, "display": 12, "displaying": 1, "spam": 3, "portuguese": 7, "seventy": 7, "form": 3, "stuff": 5, "entree": 2, "previously": 2, "requested": 2, "expand": 0, "stores": 12, "dessert": 37, "india": 0, "taquerias": 0, "roast": 10, "casa-de-eva": 22, "cambodiana": 27, "many": 31, "entrees": 12, "picante": 26, "spicy": 39, "changed": 4, "pancakes": 13, "wrong": 17, "stuffed": 24, "inn": 32, "hunan": 3, "cantonese": 8, "particularly": 3, "meals": 7, "fridays": 3, "jewish": 3, "cycling": 4, "enjoy": 0, "breakfasts": 0, "coke": 1, "saturdays": 0, "shop": 0, "its": 9, "telephone": 5, "number": 5, "lunchtime": 6, "green": 3, "takeout": 13, "services": 6, "potato": 2, "waffles": 0, "continental": 32, "park": 0, "berp": 12, "healthy": 1, "lo": 1, "cal": 1, "ca": 6, "chocolate": 1, "sundae": 1, "pastries": 1, "fattening": 2, "their": 9, "santa": 17, "fe": 17, "neighborhood": 5, "offers": 1, "ranges": 5, "pie": 3, "lobster": 3, "bagel": 6, "sweet": 11, "basil's": 1, "rick": 6, "ann's": 6, "suggest": 3, "eating": 17, "nearby": 35, "albany": 3, "el": 3, "cerrito": 3, "doesn't": 0, "spenger": 5, "people": 11, "caviar": 1, "turkey": 12, "duck": 4, "keep": 3, "coupla": 4, "closer": 15, "low": 4, "idea": 6, "problem": 0, "sho": 11, "joshu-ya": 23, "zachary's": 0, "takes": 2, "cause": 6, "hot": 1, "traditional": 1, "cake": 5, "feet": 5, "quarter": 8, "yes": 17, "southwestern": 1, "asked": 1, "southwest": 1, "oliveto": 22, "fourteen": 12, "menus": 0, "typical": 8, "wait": 10, "party": 9, "yesterday": 7, "creme-de-la-creme": 0, "mermaid": 9, "talk": 0, "dream": 2, "mid-price": 8, "italy": 4, "question": 6, "augusta's": 27, "jamaican": 3, "require": 3, "call": 3, "ahead": 3, "finding": 5, "fact": 4, "dara": 4, "appear": 4, "fu": 9, "perhaps": 0, "believe": 6, "gross": 3, "national": 3, "product": 3, "chief": 3, "exports": 3, "africa": 3, "basil": 9, "located": 53, "address": 4, "least": 2, "exactly": 4, "sixty": 31, "pesos": 0, "malaysia": 4, "non-vegetarian": 1, "tuesdays": 4, "rupees": 1, "buddhist": 6, "vegan": 1, "govinda's": 1, "basque": 0, "college": 4, "panini's": 0, "bye": 8, "speak": 2, "shops": 0, "sell": 6, "pad": 6, "noodle": 6, "fries": 2, "ham": 4, "few": 12, "milkshakes": 2, "parlor": 3, "fettucini": 4, "cookies": 0, "buy": 0, "cookie": 0, "arab": 2, "arabic": 0, "whatever": 2, "choose": 1, "referred": 0, "wherever": 0, "bad": 12, "might": 15, "questions": 2, "heard": 3, "mediterraneum": 7, "northside": 3, "listed": 4, "brewed": 3, "awakening": 3, "coffeehouse": 3, "triple": 6, "rock": 6, "brewery": 6, "weeknights": 5, "landmark": 4, "cedar": 4, "lasagna": 5, "med": 4, "ah": 1, "hard": 3, "computer": 57, "science": 6, "institute": 6, "father": 26, "eater": 18, "he": 26, "both": 18, "managed": 18, "mainly": 8, "worried": 8, "junk": 4, "spoon": 7, "christmas": 0, "thanksgiving": 0, "easter": 2, "total": 12, "unlimited": 0, "mel's": 11, "poland": 0, "australian": 34, "sounds": 3, "lox": 3, "stock": 3, "shit": 6, "saul": 17, "grace": 1, "reach": 1, "ta": 7, "kidding": 7, "israel": 3, "carl": 20, "carl's": 6, "jr": 6, "bell": 1, "always": 8, "vegetables": 9, "eighteen": 0, "names": 6, "dish": 2, "jefferson": 5, "cheval": 17, "flashy": 8, "simple": 8, "trip": 7, "being": 9, "poor": 9, "whole": 9, "delhi": 1, "junction": 1, "dim": 11, "sum": 11, "lococo's": 0, "bakeries": 1, "bakeshop": 3, "violeta": 25, "lantern": 7, "disappointed": 2, "iranian": 1, "bill": 2, "mornings": 8, "salsa": 3, "alfredo": 2, "bus": 11, "gave": 17, "return": 6, "without": 2, "maximum": 2, "prepared": 5, "doing": 1, "wondering": 3, "noon": 12, "below": 6, "restate": 3, "system": 2, "who": 1, "informations": 5, "weather": 7, "marina": 19, "smart": 2, "increase": 6, "matching": 3, "marie": 26, "doesn": 4, ";": 4, "t": 4, "carne": 2, "asada": 2, "cinnamon": 6, "roll": 6, "malts": 1, "shakes": 3, "intend": 7, "sense": 6, "since": 3, "comprehensive": 3, "item": 2, "selection": 15, "realized": 1, "switch": 2, "vary": 5, "directions": 0, "even": 8, "higher": 0, "steps": 7, "billion": 1, "sea": 16, "claremont": 23, "sit": 3, "log": 8, "off": 17, "egyptian": 4, "past": 20, "center": 20, "martin": 40, "luther": 40, "king": 56, "forgot": 26, "already": 31, "whenever": 1, "remove": 3, "sure": 4, "anybody": 3, "ever": 3, "marmara": 5, "copy": 0, "nadine": 17, "shows": 0, "lebanese": 20, "syrian": 20, "armenian": 20, "kurdish": 20, "iraqi": 20, "khasba": 11, "however": 7, "pronounce": 5, "whoa": 5, "definitely": 3, "latin": 5, "norteno": 23, "guerrero": 21, "yorkshire": 23, "anymore": 13, "prices": 3, "gary": 11, "crash": 11, "purpose": 11, "sauerkraut": 22, "special": 0, "requirements": 0, "depends": 0, "reasonable": 24, "candle": 5, "light": 5, "rolls": 0, "persons": 2, "rib": 1, "eye": 1, "steaks": 1, "wiener": 2, "schnitzel": 2, "beni": 0, "hama": 0, "bavarian": 2, "red": 6, "bordeaux": 6, "buddy": 3, "asia": 3, "japan": 4, "spending": 26, "houses": 1, "barclay": 3, "served": 1, "weekdays": 1, "answer": 0, "shall": 4, "extend": 2, "feel": 0, "smokey": 4, "joe": 4, "issue": 0, "paz": 1, "probably": 0, "beg": 4, "eighty": 0, "mall": 3, "listing": 6, "different": 2, "complete": 4, "longer": 4, "kilometer": 6, "until": 7, "enchiladas": 0, "approximately": 2, "put": 3, "down": 3, "fruits": 3, "cheese": 1, "course": 1, "costing": 7, "pepito": 14, "average": 6, "brennan": 22, "data": 1, "base": 1, "never": 2, "eaten": 2, "milvia": 14, "excuse": 10, "cannibal": 6, "precise": 9, "affordable": 5, "farthest": 4, "arabian": 3, "head": 0, "joshu-ya's": 2, "eleven": 8, "everett": 31, "jones": 31, "flint": 26, "chuck": 11, "pasand's": 0, "moe": 0, "pork": 2, "someplace": 24, "addition": 9, "those": 3, "amaru": 15, "casbah": 19, "renaissance": 30, "daruma": 19, "teashop": 19, "gertie's": 14, "gramma": 7, "juice": 10, "collective": 10, "mario": 19, "fiesta": 19, "swallow": 9, "tsing": 9, "tao": 9, "vasiliki": 12, "chicago": 10, "each": 5, "nicest": 0, "waiter": 0, "able": 2, "imported": 0, "rose": 2, "sixteen": 1, "student": 15, "had": 15}